tap "domt4/autoupdate"
tap "dorcha-inc/orla"
# Open-source formatting library for C++
brew "fmt"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Language Server for Ansible Files
brew "ansible-language-server"
# Code searching, linting, rewriting
brew "ast-grep"
# Text-based UI library
brew "ncurses"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Ruby environment tool
brew "chruby"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Thin wrapper around chruby to make it work with the Fish shell
brew "chruby-fish"
# Binary-decimal and decimal-binary routines for IEEE doubles
brew "double-conversion"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Audit git repos for secrets
brew "gitleaks"
# Application-level logging library
brew "glog"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Asynchronous event library
brew "libevent"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Post-modern modal text editor
brew "helix"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# CLI for managing Apache Kafka
brew "kafkactl"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# OpenID Connect authentication plugin for kubectl
brew "kubelogin"
# Translate LaTeX to RTF
brew "latex2rtf"
# Simple terminal UI for git commands
brew "lazygit"
# Lets you manipulate the signature block in a Mach-O binary
brew "ldid"
# Library for encoding and decoding .avif files
brew "libavif"
# Portable Foreign Function Interface library
brew "libffi"
# NaCl networking and cryptography library
brew "libsodium"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Personal Knowledge Management System for the LSP
brew "markdown-oxide"
# Generate a markdown TOC (table of contents) with Remarkable
brew "markdown-toc"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Language Server Protocol for Markdown
brew "marksman"
# CLI for Mermaid library
brew "mermaid-cli"
# Fast and user friendly build system
brew "meson"
# Sign files & verify signatures. Works with signify in OpenBSD
brew "minisign"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Programming language with focus on simplicity, performance and modern systems
brew "odin"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Optimized BLAS library
brew "openblas"
# Development kit for the Java programming language
brew "openjdk"
# Highly capable, feature-rich programming language
brew "perl"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Paste PNG into files
brew "pngpaste"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Safe, concurrent, practical language
brew "rust"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Powerful free data recovery utility
brew "testdisk"
# Official tldr client written in Rust
brew "tlrc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pretty print math in monospace fonts, using a TeX-like syntax
brew "utftex"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your CLI home video recorder
brew "vhs"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Language Server for Yaml Files
brew "yaml-language-server"
# Tracks most-used directories to make cd smarter
brew "z"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Enable Windows-like alt-tab
cask "alt-tab"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Monitors common persistence locations
cask "blockblock"
# E-books management software
cask "calibre"
# Voice and text chat software
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "font-opendyslexic-nerd-font"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# File archiver
cask "keka"
# GPU-based terminal emulator
cask "kitty"
# Utility that shows the latest app updates
cask "latest"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Clipboard manager
cask "maccy"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# A dead-simple unix tool for lightweight agents
cask "dorcha-inc/orla/orla"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Protect your personal files
cask "ransomwhere"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Scans, detects, and monitors keyboard taps
cask "reikey"
# Open source virtual/remote desktop application
cask "rustdesk"
# Menu bar manager
cask "thaw"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
