tap "domt4/autoupdate"
# Simple, modern, secure file encryption
brew "age"
# Code searching, linting, rewriting
brew "ast-grep"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Optimized BLAS library
brew "openblas"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Library for encoding and decoding .avif files
brew "libavif"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Audit git repos for secrets
brew "gitleaks"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Fast, Dynamic Programming Language
brew "julia"
# CLI for managing Apache Kafka
brew "kafkactl"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# OpenID Connect authentication plugin for kubectl
brew "kubelogin"
# Translate LaTeX to RTF
brew "latex2rtf"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Lets you manipulate the signature block in a Mach-O binary
brew "ldid"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Platform built on V8 to build network applications
brew "node"
# Generate a markdown TOC (table of contents) with Remarkable
brew "markdown-toc"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# CLI for Mermaid library
brew "mermaid-cli"
# Fast and user friendly build system
brew "meson"
# Sign files & verify signatures. Works with signify in OpenBSD
brew "minisign"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# Highly capable, feature-rich programming language
brew "perl"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Powerful free data recovery utility
brew "testdisk"
# Pretty print math in monospace fonts, using a TeX-like syntax
brew "utftex"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Tracks most-used directories to make cd smarter
brew "z"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Enable Windows-like alt-tab
cask "alt-tab"
# E-books management software
cask "calibre"
# Universal database tool and SQL client
cask "dbeaver-community"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to hide menu bar items
cask "hiddenbar"
# Utility that shows the latest app updates
cask "latest"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Clipboard manager
cask "maccy"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Open source virtual/remote desktop application
cask "rustdesk"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
